{
  "_class_name": "UNet2DModel",
  "_diffusers_version": "0.14.0",
  "act_fn": "silu",
  "add_attention": true,
  "attention_head_dim": 8,
  "block_out_channels": [
    224,
    448,
    672,
    896
  ],
  "center_input_sample": false,
  "class_embed_type": null,
  "down_block_types": [
    "DownBlock2D",
    "AttnDownBlock2D",
    "AttnDownBlock2D",
    "AttnDownBlock2D"
  ],
  "downsample_padding": 1,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 4,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_class_embeds": null,
  "out_channels": 4,
  "resnet_time_scale_shift": "default",
  "sample_size": [
    48,
    64
  ],
  "time_embedding_type": "positional",
  "up_block_types": [
    "AttnUpBlock2D",
    "AttnUpBlock2D",
    "AttnUpBlock2D",
    "UpBlock2D"
  ]
}
